/*********************************************************************
    程序名: 分析程序的功能
    版权:免费
    作者: 丁朝远
    日期: 2024-10-23 11:04
    说明: C语言循环程序设计
*********************************************************************/
#include <stdio.h>

int main() {
	int i;
	int fact;
	fact = 2;
	i = 1;
	do {
		i = i + 1;
		fact = fact * i; //虽然i取到10，但要计算完毕才判定，故计算11！的2倍
	} while (i <= 10);
	printf("%d\n", fact);
	/*以下为验证代码
	for (i = 2, fact = 1; i <= 11; i++)
		fact *= i;
	printf("%d\n", 2 * fact);
	*/
}
