/********************************************
    程序名: 用级数展开计算e的近似值
    版  权: 免费
    作  者: 丁朝远
    日  期: 2024-10-23 11:04
    说  明: C语言循环程序设计
*********************************************/
//(n+1)!=(n-1)!*n，可把上一个n的阶乘值保留，乘以n+1就是(n+1)!
//把前面2项以初值赋给结果，累加从第3项开始

#include <stdio.h>
#define error 1e-6 //可以在这里修改省略项的要求

int main() {
	int i = 2, k = 1;
	double e, term = 1;//为保证顺利进入循环，给term赋满足条件的初值
	e = 2;
	while (term > error) {
		k *= i;
		term = 1.0 / k;//斜除会取整，故用1.0
		e += term;
		i++;
	}
	printf("\ne的近似值为：%18.15lf\n", e);
	return 0;
}
