/********************************************
    程序名: 用级数展开计算sinx的近似值
    版  权: 免费
    作  者: 丁朝远
    日  期: 2024-10-23 11:04
    说  明: C语言循环程序设计
*********************************************/
//x为弧度
//循环条件按为某项值大于给定值，保证x=0时得到真确结果，把第一项以初值形式
//赋给相关变量
#include <stdio.h>
#include <math.h>

int main() {
	double x, y, term, sin;
	int i = 1, k = 1, sign = 1;
	printf("输入x的值(度):x=");//用度方便用特殊角度检验程序正确性
	scanf("%lf", &x);
	x = x * 3.14159265 / 180;//换成弧度
	sin = term = y = x;  //赋初值，保证x=0的正确性，循环累加从第二项开始
	while (fabs(term) > 1e-6) {
		k *= (2 * i) * (2 * i + 1);
		sign = -sign;
		y *= x * x;
		term = sign * y / k;
		sin += term;
		i++;
	}
	printf("sin(%.0lf)=%18.15lf", x * 180 / 3.14159265, sin);
	return 0;
}

