/*********************************************************************
    程序名: 输出1~100的所有素数
    版  权:免费
    作  者:丁朝远
    日  期: 2024-10-29 17:47
    说  明:c语言循环程序设计练习
*********************************************************************/
//用两循环，一个循环控制数从1变化到100，一个循环判定1~100中某个数是否为素数
#include <stdio.h>

int main() {
	int i, j;
	printf("\n1~100的素数有\n");
	for (i = 1; i <= 100; i++) {
		if (i == 1)
			continue;
		else if (i == 2)
			printf("%d ", i);
		else {
			for (j = 2; j < i; j++)
				if (i % j == 0)
					break;
			if (j == i)
				printf("%d ", i);
		}

	}
	return 0;
}
