/*********************************************************************
    程序名: 菱形星号图案
    版权: 免费
    作者: 丁朝远
    日期: 2024-10-23 10:54
    说明: c语言循环程序设计练习
*********************************************************************/
//把前4行和后3行分开处理
//前4行每行有4-i个空格，2*i-1个星号
//后3行每行有2*i个空格，7-2*i个星号

#include <stdio.h>

int main() {
	int i, j;

	//先输出前4行，每行输出完该行空格后输出该行星号
	for (i = 1; i <= 4; i++) {
		printf("\t"); //调节图案输出位置
		for (j = 1; j <= 4 - i; j++)
			printf(" ");   //输出前4-i个空格
		for (j = 1; j <= (2 * i - 1); j++)
			printf("*");  //输出2*i-1个星号
		printf("\n");
	}
	//再输出后3行
	for (i = 1; i <= 3; i++) {
		printf("\t");  //调节图案输出位置
		for (j = 1; j <= i; j++)
			printf(" ");
		for (j = 1; j <= 7 - 2 * i; j++)
			printf("*");
		printf("\n");
	}

	return 0;
}
