/*********************************************************************
    程序名: 求函数积分问题
    版  权:免费
    作  者:丁朝远
    日  期: 2024-10-29 17:47
    说  明:c语言循环程序设计练习
*********************************************************************/
//用[a,b]区间内划分的N个曲边梯形面积和来近似积分
//当前后两次计算结构差异小于某个给定较小整数，可以认为得到了积分的数值解
//为保证收敛的一致性，也可以连续2次前后计算的差异小于某个给定值，计算时间长

#include <stdio.h>
#include <math.h>
#define error 1e-6

int main() {
	float a, b;
	int N = 1000;//越大，while循环次数少，for循环次数多
	double h, f1 = 0, f2 = 0.5;
	printf("请输入积分区间：");
	scanf("%f %f", &a, &b);
	while (fabs(f2 - f1) > error) {
		h = (b - a) * 1.0 / N;
		f1 = f2;
		f2 = 0;
		for (int i = 1; i <= N; i++)
			f2 += ((a + i * h) * pow(sin(a + i * h), 3) + 1 / log(1 + (a + i * h) * (a + i * h)))  * h;
		printf("\n%d\t\t%15.10lf\t\t%lf\n", N, f2, f2 - f1);
		N = N * 2; //N变化越快，while循环次数少，for循环次数多
	}
	return 0;
}
